//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:	ATACTRL.UNI
//
// Description:	ATA Controller setup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#string STR_DXIO_CONFIG_FORM                  #language eng "DXIO configuration"
#string STR_DXIO_CONFIG_FORM_HELP             #language eng "This Option Is Used For Configuring CPU DXIO"

#string STR_ENABLE_DXIO_CONFIG                #language eng "Enable DXIO configuration"
#string STR_ENABLE_DXIO_CONFIG_HELP           #language eng "Enable DXIO configuration"
#string STR_DIE0_DXIO_TYPE_A_CFG              #language eng "P0 SLOT(D0T0)"
#string STR_DIE0_DXIO_TYPE_A_CFG_HELP         #language eng "DIE 0 DXIO Type A"
#string STR_DIE1_DXIO_TYPE_A_CFG              #language eng "G2 SLOT(D1T0)"
#string STR_DIE1_DXIO_TYPE_A_CFG_HELP         #language eng "DIE 1 DXIO Type A"

#string STR_DIE0_DXIO_TYPE_B_CFG              #language eng "G0 SLOT(D0T1)"
#string STR_DIE0_DXIO_TYPE_B_CFG_HELP         #language eng "DIE 0 DXIO Type B"
#string STR_DIE1_DXIO_TYPE_B_CFG              #language eng "P2 SLOT(D1T1)"
#string STR_DIE1_DXIO_TYPE_B_CFG_HELP         #language eng "DIE 1 DXIO Type B"

#string STR_NORMAL                            #language eng "Normal"
#string STR_CFG_ENABLE                        #language eng "Enable"
#string STR_CFG_DISABLE                       #language eng "Disable"
#string STR_PNS_CARD                          #language eng "Support PNS Card"
#string STR_PNS_CARD_PDE                      #language eng "Support PNS Card Disable I350"
#string STR_PCIE_1X16                         #language eng "PCIE-x16"
#string STR_PCIE_2X8                          #language eng "PCIE-x8-x8"
#string STR_PCIE_4X4                          #language eng "PCIE-x4-x4-x4-x4"

#string STR_2SFP_2SGMII                       #language eng "Support 2SFP_2SGMII"
#string STR_4SGMII                            #language eng "Support 4SGMII"
#string STR_KR_BCM84328                       #language eng "Support KR_BCM84328"
#string STR_KR_inphi4233                      #language eng "Support KR_inphi4233"
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************